## Terraform Check Results
#### Terraform Format and Style 🖌`success`
#### Bootstrap Terraform Initialization ⚙️`success`
#### Bootstrap Terraform Validation 🤖`success`
#### Bootstrap Terraform Plan 📖`success`

#### OMOP Terraform Initialization ⚙️`success`
#### OMOP Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azuread_application.spomop will be created
  + resource "azuread_application" "spomop" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "sp-for-check-ci-omop-service-connection"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = (sensitive)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }
    }

  # azuread_directory_role.directoryreaders will be created
  + resource "azuread_directory_role" "directoryreaders" {
      + description  = (known after apply)
      + display_name = "Directory Readers"
      + id           = (known after apply)
      + object_id    = (known after apply)
      + template_id  = (known after apply)
    }

  # azuread_directory_role_member.directoryreadersmember will be created
  + resource "azuread_directory_role_member" "directoryreadersmember" {
      + id               = (known after apply)
      + member_object_id = (sensitive)
      + role_object_id   = (sensitive)
    }

  # azuread_group.dbadminsaadgroup will be created
  + resource "azuread_group" "dbadminsaadgroup" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "check-ci-omop-sql-server-admins"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = "check-ci-omop-sql-server-admins"
      + members                        = (sensitive)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (sensitive)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # azuread_group.directoryreadersaadgroup will be created
  + resource "azuread_group" "directoryreadersaadgroup" {
      + assignable_to_role             = true
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "check-ci-omop-sql-server-directory-readers"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = "check-ci-omop-sql-server-directory-readers"
      + members                        = (sensitive)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (sensitive)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # azuread_service_principal.spomop will be created
  + resource "azuread_service_principal" "spomop" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = (sensitive)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # azuread_service_principal_password.spomop will be created
  + resource "azuread_service_principal_password" "spomop" {
      + display_name         = (known after apply)
      + end_date             = (known after apply)
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + service_principal_id = (sensitive)
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

  # azuredevops_build_definition.broadseabuildpipeline will be created
  + resource "azuredevops_build_definition" "broadseabuildpipeline" {
      + agent_pool_name = "Azure Pipelines"
      + id              = (known after apply)
      + name            = "Broadsea Build Pipeline"
      + path            = "\OHDSIOnAzure\check-ci\Broadsea"
      + project_id      = (known after apply)
      + revision        = (known after apply)
      + variable_groups = (known after apply)

      + repository {
          + branch_name         = (known after apply)
          + repo_id             = (known after apply)
          + repo_type           = "TfsGit"
          + report_build_status = true
          + yml_path            = "/pipelines/broadsea_build_pipeline.yaml"
        }
    }

  # azuredevops_build_definition.broadseareleasepipeline will be created
  + resource "azuredevops_build_definition" "broadseareleasepipeline" {
      + agent_pool_name = "Azure Pipelines"
      + id              = (known after apply)
      + name            = "Broadsea Release Pipeline"
      + path            = "\OHDSIOnAzure\check-ci\Broadsea"
      + project_id      = (known after apply)
      + revision        = (known after apply)
      + variable_groups = (known after apply)

      + repository {
          + branch_name         = (known after apply)
          + repo_id             = (known after apply)
          + repo_type           = "TfsGit"
          + report_build_status = true
          + yml_path            = "/pipelines/broadsea_release_pipeline.yaml"
        }

      + variable {
          + allow_override = true
          + is_secret      = false
          + name           = "broadseaBuildPipelineId"
          + value          = (known after apply)
        }
    }

  # azuredevops_build_definition.tfapplyenvironmentpipeline will be created
  + resource "azuredevops_build_definition" "tfapplyenvironmentpipeline" {
      + agent_pool_name = "Azure Pipelines"
      + id              = (known after apply)
      + name            = "TF Apply OMOP Environment Pipeline"
      + path            = "\OHDSIOnAzure\check-ci\Terraform"
      + project_id      = (known after apply)
      + revision        = (known after apply)
      + variable_groups = (known after apply)

      + repository {
          + branch_name         = (known after apply)
          + repo_id             = (known after apply)
          + repo_type           = "TfsGit"
          + report_build_status = true
          + yml_path            = "/pipelines/environments/omop-terraform-apply.yaml"
        }
    }

  # azuredevops_build_definition.tfdestroyenvironmentpipeline will be created
  + resource "azuredevops_build_definition" "tfdestroyenvironmentpipeline" {
      + agent_pool_name = "Azure Pipelines"
      + id              = (known after apply)
      + name            = "TF Destroy OMOP Environment Pipeline"
      + path            = "\OHDSIOnAzure\check-ci\Terraform"
      + project_id      = (known after apply)
      + revision        = (known after apply)
      + variable_groups = (known after apply)

      + repository {
          + branch_name         = (known after apply)
          + repo_id             = (known after apply)
          + repo_type           = "TfsGit"
          + report_build_status = true
          + yml_path            = "/pipelines/environments/omop-terraform-destroy.yaml"
        }
    }

  # azuredevops_build_definition.vocabularybuildpipeline will be created
  + resource "azuredevops_build_definition" "vocabularybuildpipeline" {
      + agent_pool_name = "Azure Pipelines"
      + id              = (known after apply)
      + name            = "Vocabulary Build Pipeline"
      + path            = "\OHDSIOnAzure\check-ci\Vocabulary"
      + project_id      = (known after apply)
      + revision        = (known after apply)
      + variable_groups = (known after apply)

      + repository {
          + branch_name         = (known after apply)
          + repo_id             = (known after apply)
          + repo_type           = "TfsGit"
          + report_build_status = true
          + yml_path            = "/pipelines/vocabulary_build_pipeline.yaml"
        }
    }

  # azuredevops_build_definition.vocabularyreleasepipeline will be created
  + resource "azuredevops_build_definition" "vocabularyreleasepipeline" {
      + agent_pool_name = "Azure Pipelines"
      + id              = (known after apply)
      + name            = "Vocabulary Release Pipeline"
      + path            = "\OHDSIOnAzure\check-ci\Vocabulary"
      + project_id      = (known after apply)
      + revision        = (known after apply)
      + variable_groups = (known after apply)

      + repository {
          + branch_name         = (known after apply)
          + repo_id             = (known after apply)
          + repo_type           = "TfsGit"
          + report_build_status = true
          + yml_path            = "/pipelines/vocabulary_release_pipeline.yaml"
        }

      + variable {
          + allow_override = true
          + is_secret      = false
          + name           = "vocabularyBuildPipelineId"
          + value          = (known after apply)
        }
    }

  # azuredevops_git_repository.repo will be created
  + resource "azuredevops_git_repository" "repo" {
      + default_branch = (known after apply)
      + id             = (known after apply)
      + is_fork        = (known after apply)
      + name           = "OHDSIonAzure"
      + project_id     = (known after apply)
      + remote_url     = (known after apply)
      + size           = (known after apply)
      + ssh_url        = (known after apply)
      + url            = (known after apply)
      + web_url        = (known after apply)

      + initialization {
          + init_type   = "Import"
          + source_type = "Git"
          + source_url  = "https://github.com/microsoft/OHDSIonAzure.git"
        }
    }

  # azuredevops_project.project will be created
  + resource "azuredevops_project" "project" {
      + description         = "AzDevOps OHDSI on Azure bootstrap project"
      + id                  = (known after apply)
      + name                = "check-ci-OHDSIonAzure"
      + process_template_id = (known after apply)
      + version_control     = "Git"
      + visibility          = "private"
      + work_item_template  = "Agile"
    }

  # azuredevops_resource_authorization.adoenvvgauthbroadseabuild will be created
  + resource "azuredevops_resource_authorization" "adoenvvgauthbroadseabuild" {
      + authorized    = true
      + definition_id = (known after apply)
      + id            = (known after apply)
      + project_id    = (known after apply)
      + resource_id   = (known after apply)
      + type          = "variablegroup"
    }

  # azuredevops_resource_authorization.adoenvvgauthbroadsearelease will be created
  + resource "azuredevops_resource_authorization" "adoenvvgauthbroadsearelease" {
      + authorized    = true
      + definition_id = (known after apply)
      + id            = (known after apply)
      + project_id    = (known after apply)
      + resource_id   = (known after apply)
      + type          = "variablegroup"
    }

  # azuredevops_resource_authorization.adoenvvgauthvocabularybuild will be created
  + resource "azuredevops_resource_authorization" "adoenvvgauthvocabularybuild" {
      + authorized    = true
      + definition_id = (known after apply)
      + id            = (known after apply)
      + project_id    = (known after apply)
      + resource_id   = (known after apply)
      + type          = "variablegroup"
    }

  # azuredevops_resource_authorization.adoenvvgauthvocabularyrelease will be created
  + resource "azuredevops_resource_authorization" "adoenvvgauthvocabularyrelease" {
      + authorized    = true
      + definition_id = (known after apply)
      + id            = (known after apply)
      + project_id    = (known after apply)
      + resource_id   = (known after apply)
      + type          = "variablegroup"
    }

  # azuredevops_resource_authorization.auth will be created
  + resource "azuredevops_resource_authorization" "auth" {
      + authorized  = true
      + id          = (known after apply)
      + project_id  = (known after apply)
      + resource_id = (known after apply)
      + type        = "endpoint"
    }

  # azuredevops_resource_authorization.tfapplyadobootstrapsettingsvgauth will be created
  + resource "azuredevops_resource_authorization" "tfapplyadobootstrapsettingsvgauth" {
      + authorized    = true
      + definition_id = (known after apply)
      + id            = (known after apply)
      + project_id    = (known after apply)
      + resource_id   = (known after apply)
      + type          = "variablegroup"
    }

  # azuredevops_resource_authorization.tfapplyadobootstrapvgauth will be created
  + resource "azuredevops_resource_authorization" "tfapplyadobootstrapvgauth" {
      + authorized    = true
      + definition_id = (known after apply)
      + id            = (known after apply)
      + project_id    = (known after apply)
      + resource_id   = (known after apply)
      + type          = "variablegroup"
    }

  # azuredevops_resource_authorization.tfdestroyadobootstrapsettingsvgauth will be created
  + resource "azuredevops_resource_authorization" "tfdestroyadobootstrapsettingsvgauth" {
      + authorized    = true
      + definition_id = (known after apply)
      + id            = (known after apply)
      + project_id    = (known after apply)
      + resource_id   = (known after apply)
      + type          = "variablegroup"
    }

  # azuredevops_resource_authorization.tfdestroyadobootstrapvgauth will be created
  + resource "azuredevops_resource_authorization" "tfdestroyadobootstrapvgauth" {
      + authorized    = true
      + definition_id = (known after apply)
      + id            = (known after apply)
      + project_id    = (known after apply)
      + resource_id   = (known after apply)
      + type          = "variablegroup"
    }

  # azuredevops_serviceendpoint_azurerm.endpointazure will be created
  + resource "azuredevops_serviceendpoint_azurerm" "endpointazure" {
      + authorization             = (known after apply)
      + azurerm_spn_tenantid      = (sensitive)
      + azurerm_subscription_id   = (sensitive)
      + azurerm_subscription_name = (sensitive)
      + description               = "Managed by Terraform"
      + id                        = (known after apply)
      + project_id                = (known after apply)
      + service_endpoint_name     = "sp-check-ci-omop-service-connection"

      + credentials {
          + serviceprincipalid       = (known after apply)
          + serviceprincipalkey      = (sensitive value)
          + serviceprincipalkey_hash = (sensitive value)
        }
    }

  # azuredevops_serviceendpoint_generic_git.serviceendpoint will be created
  + resource "azuredevops_serviceendpoint_generic_git" "serviceendpoint" {
      + authorization           = (known after apply)
      + description             = "Managed by Terraform"
      + enable_pipelines_access = true
      + id                      = (known after apply)
      + password                = (sensitive value)
      + password_hash           = (sensitive value)
      + project_id              = (known after apply)
      + repository_url          = (sensitive)
      + service_endpoint_name   = "check-ci Sample Generic Git"
      + username                = ""
    }

  # azuredevops_variable_group.adobootstrapsettingsvg will be created
  + resource "azuredevops_variable_group" "adobootstrapsettingsvg" {
      + allow_access = false
      + description  = "Azure DevOps Variable Group without KV used for bootstrapping an environment"
      + id           = (known after apply)
      + name         = "check-ci-ado-bootstrap-settings-vg"
      + project_id   = (known after apply)

      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "aad_admin_login_name"
          + value        = "check-ci-omop-sql-server-admins"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "aad_admin_object_id"
          + value        = (known after apply)
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "aad_directory_readers_login_name"
          + value        = "check-ci-omop-sql-server-directory-readers"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "aad_directory_readers_object_id"
          + value        = (known after apply)
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "acr_sku_edition"
          + value        = "Premium"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "adoVMSSBuildAgentPoolName"
          + value        = "check-ci-ado-build-linux-vmss-agent-pool"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "ado_agent_pool_vmss_name"
          + value        = "check-ci-ado-build-linux-vmss-agent"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "asp_kind_edition"
          + value        = "Linux"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "asp_sku_size"
          + value        = "P2V2"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "asp_sku_tier"
          + value        = "PremiumV2"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "azure_service_connection_name"
          + value        = "sp-check-ci-omop-service-connection"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "cdr_vocab_container_name"
          + value        = "vocabularies"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "enable_cleanup"
          + value        = "0"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "environment"
          + value        = "ci"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "location"
          + value        = "westus3"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "omop_db_size"
          + value        = "100"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "omop_db_sku"
          + value        = "GP_Gen5_8"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "prefix"
          + value        = "check"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "tf_approval_environment"
          + value        = "check-ci-omop-tf-apply-environment"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "tf_plan_environment"
          + value        = "check-ci-omop-tf-plan-environment"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "tf_state_filename"
          + value        = "terraform.tfstate"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "tf_storage_account_name"
          + value        = "checkcitfstatesa"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "tf_storage_container_name"
          + value        = "check-ci-statefile-container"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "tf_storage_region"
          + value        = "westus3"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "tf_storage_resource_group"
          + value        = "check-ci-ado-bootstrap-omop-rg"
        }
    }

  # azuredevops_variable_group.adobootstrapvg will be created
  + resource "azuredevops_variable_group" "adobootstrapvg" {
      + allow_access = false
      + description  = "Azure DevOps Variable Group linked to Azure Key Vault used for bootstrapping an environment"
      + id           = (known after apply)
      + name         = "check-ci-ado-bootstrap-vg"
      + project_id   = (known after apply)

      + key_vault {
          + name                = "check-ci-omop-kv"
          + service_endpoint_id = (known after apply)
        }

      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "bootstrapAdminObjectId"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "omopPassword"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "spServiceConnectionObjectId"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "storageAccountKey"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "vmssManagedIdentityObjectId"
        }
    }

  # azuredevops_variable_group.adoenvvg will be created
  + resource "azuredevops_variable_group" "adoenvvg" {
      + allow_access = false
      + description  = "Azure Variable Group for Azure DevOps OMOP Environment Settings"
      + id           = (known after apply)
      + name         = "check-ci-omop-environment-settings-vg"
      + project_id   = (known after apply)

      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "adoAgentPoolVMSSName"
          + value        = "check-ci-ado-build-linux-vmss-agent"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "adoAgentPoolWindowsVMSSName"
          + value        = "check-ci-ado-build-windows-vmss-agent"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "adoVMSSBuildAgentPoolName"
          + value        = "check-ci-ado-build-linux-vmss-agent-pool"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "adoWindowsVMSSBuildAgentPoolName"
          + value        = "check-ci-ado-build-windows-vmss-agent-pool"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "appSvcName"
          + value        = "check-ci-omop-broadsea"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "appSvcRg"
          + value        = "check-ci-omop-rg"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "broadseaBuildPipelineName"
          + value        = "Broadsea Build Pipeline"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "broadseaReleasePipelineName"
          + value        = "Broadsea Release Pipeline"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "broadsea_build_environment"
          + value        = "check-ci-omop-broadsea-build-environment"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "broadsea_release_environment"
          + value        = "check-ci-omop-broadsea-release-environment"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "cdmSchema"
          + value        = "dbo"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "cdmVersion"
          + value        = "5.3.1"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "containerRegistry"
          + value        = "checkciacr"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "dSVocabularyBlobStorageName"
          + value        = "DSVocabularyBlobStorage"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "enableCleanup"
          + value        = "0"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "environment"
          + value        = "ci"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "prefix"
          + value        = "check"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "projectName"
          + value        = "check-ci-OHDSIonAzure"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "resultsSchema"
          + value        = "2.7.0"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "resultsSchema"
          + value        = "webapi"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "serviceConnection"
          + value        = "sp-check-ci-omop-service-connection"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "sqlServerDbName"
          + value        = "check_ci_omop_db"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "sqlServerName"
          + value        = "check-ci-omop-sql-server"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "storageAccount"
          + value        = "checkciomopsa"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "syntheaSchema"
          + value        = "synthea"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "syntheaVersion"
          + value        = "2.7.0"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "vocabSchema"
          + value        = "dbo"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "vocabulariesContainerPath"
          + value        = "vocabularies/19-AUG-2021"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "vocabularyBuildPipelineName"
          + value        = "Vocabulary Build Pipeline"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "vocabularyReleasePipelineName"
          + value        = "Vocabulary Release Pipeline"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "vocabularyVersion"
          + value        = "19-AUG-2021"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "vocabulary_build_environment"
          + value        = "check-ci-omop-vocabulary-build-environment"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "vocabulary_release_environment"
          + value        = "check-ci-omop-vocabulary-release-environment"
        }
      + variable {
          + content_type = (known after apply)
          + enabled      = (known after apply)
          + expires      = (known after apply)
          + is_secret    = false
          + name         = "webapiSources"
          + value        = "https://check-ci-omop-broadsea.azurewebsites.net/WebAPI/source"
        }
    }

  # azurerm_key_vault.keyvault will be created
  + resource "azurerm_key_vault" "keyvault" {
      + access_policy               = [
          + {
              + application_id          = null
              + certificate_permissions = [
                  + "Get",
                  + "List",
                  + "Update",
                  + "Create",
                  + "Import",
                  + "Delete",
                  + "Recover",
                  + "Backup",
                  + "Restore",
                ]
              + key_permissions         = [
                  + "Get",
                  + "List",
                  + "Update",
                  + "Restore",
                  + "Backup",
                  + "Recover",
                  + "Delete",
                  + "Import",
                  + "Create",
                ]
              + object_id               = (sensitive)
              + secret_permissions      = [
                  + "Backup",
                  + "Get",
                  + "List",
                  + "Purge",
                  + "Recover",
                  + "Restore",
                  + "Set",
                  + "Delete",
                ]
              + storage_permissions     = []
              + tenant_id               = (sensitive)
            },
          + {
              + application_id          = null
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = (sensitive)
              + secret_permissions      = [
                  + "Get",
                  + "List",
                ]
              + storage_permissions     = []
              + tenant_id               = (sensitive)
            },
        ]
      + enabled_for_disk_encryption = true
      + id                          = (known after apply)
      + location                    = "westus3"
      + name                        = "check-ci-omop-kv"
      + purge_protection_enabled    = false
      + resource_group_name         = "check-ci-ado-bootstrap-omop-rg"
      + sku_name                    = "standard"
      + soft_delete_enabled         = (known after apply)
      + soft_delete_retention_days  = 7
      + tenant_id                   = (sensitive)
      + vault_uri                   = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_key_vault_secret.bootstrapAdminObjectId will be created
  + resource "azurerm_key_vault_secret" "bootstrapAdminObjectId" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "bootstrapAdminObjectId"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.omopPassword will be created
  + resource "azurerm_key_vault_secret" "omopPassword" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "omopPassword"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.spServiceConnectionObjectId will be created
  + resource "azurerm_key_vault_secret" "spServiceConnectionObjectId" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "spServiceConnectionObjectId"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.storageAccountKey will be created
  + resource "azurerm_key_vault_secret" "storageAccountKey" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "storageAccountKey"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.vmssManagedIdentityObjectId will be created
  + resource "azurerm_key_vault_secret" "vmssManagedIdentityObjectId" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "vmssManagedIdentityObjectId"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_linux_virtual_machine_scale_set.vmss will be created
  + resource "azurerm_linux_virtual_machine_scale_set" "vmss" {
      + admin_password                                    = (sensitive value)
      + admin_username                                    = (sensitive)
      + computer_name_prefix                              = (known after apply)
      + custom_data                                       = (sensitive value)
      + disable_password_authentication                   = false
      + do_not_run_extensions_on_overprovisioned_machines = false
      + extensions_time_budget                            = "PT1H30M"
      + id                                                = (known after apply)
      + instances                                         = 2
      + location                                          = "westus3"
      + max_bid_price                                     = -1
      + name                                              = "check-ci-ado-build-linux-vmss-agent"
      + overprovision                                     = false
      + platform_fault_domain_count                       = 1
      + priority                                          = "Regular"
      + provision_vm_agent                                = true
      + resource_group_name                               = "check-ci-ado-bootstrap-omop-rg"
      + scale_in_policy                                   = "Default"
      + single_placement_group                            = false
      + sku                                               = "Standard_D4s_v3"
      + tags                                              = {
          + "Deployment"  = "OHDSI on Azure"
          + "Environment" = "dev"
        }
      + unique_id                                         = (known after apply)
      + upgrade_mode                                      = "Manual"
      + zone_balance                                      = false

      + automatic_instance_repair {
          + enabled      = (known after apply)
          + grace_period = (known after apply)
        }

      + boot_diagnostics {}

      + extension {
          + auto_upgrade_minor_version = (known after apply)
          + automatic_upgrade_enabled  = (known after apply)
          + force_update_tag           = (known after apply)
          + name                       = (known after apply)
          + protected_settings         = (sensitive value)
          + provision_after_extensions = (known after apply)
          + publisher                  = (known after apply)
          + settings                   = (known after apply)
          + type                       = (known after apply)
          + type_handler_version       = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_interface {
          + enable_accelerated_networking = false
          + enable_ip_forwarding          = false
          + name                          = "terraformnetworkprofile"
          + primary                       = true

          + ip_configuration {
              + name      = "IPConfiguration"
              + primary   = true
              + subnet_id = (known after apply)
              + version   = "IPv4"
            }
        }

      + os_disk {
          + caching                   = "ReadOnly"
          + disk_size_gb              = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-focal"
          + publisher = "Canonical"
          + sku       = "20_04-lts"
          + version   = "latest"
        }

      + terminate_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

  # azurerm_network_interface.jumpbox will be created
  + resource "azurerm_network_interface" "jumpbox" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "westus3"
      + mac_address                   = (known after apply)
      + name                          = "check-ci-jumpbox-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "check-ci-ado-bootstrap-omop-rg"
      + tags                          = {
          + "Deployment"  = "OHDSI on Azure"
          + "Environment" = "dev"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "check-ci-IPConfiguration"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_public_ip.jumpbox will be created
  + resource "azurerm_public_ip" "jumpbox" {
      + allocation_method       = "Static"
      + availability_zone       = (known after apply)
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westus3"
      + name                    = "check-ci-jumpbox-public-ip"
      + resource_group_name     = "check-ci-ado-bootstrap-omop-rg"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Deployment"  = "OHDSI on Azure"
          + "Environment" = "dev"
        }
      + zones                   = (known after apply)
    }

  # azurerm_public_ip.vmss will be created
  + resource "azurerm_public_ip" "vmss" {
      + allocation_method       = "Static"
      + availability_zone       = (known after apply)
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westus3"
      + name                    = "check-ci-vmss-public-ip"
      + resource_group_name     = "check-ci-ado-bootstrap-omop-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Deployment"  = "OHDSI on Azure"
          + "Environment" = "dev"
        }
      + zones                   = (known after apply)
    }

  # azurerm_resource_group.adobootstrap will be created
  + resource "azurerm_resource_group" "adobootstrap" {
      + id       = (known after apply)
      + location = "westus3"
      + name     = "check-ci-ado-bootstrap-omop-rg"
      + tags     = {
          + "Deployment"  = "OHDSI on Azure"
          + "Environment" = "dev"
        }
    }

  # azurerm_role_assignment.main will be created
  + resource "azurerm_role_assignment" "main" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (sensitive)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_storage_account.tfstatesa will be created
  + resource "azurerm_storage_account" "tfstatesa" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "GRS"
      + account_tier                      = "Standard"
      + allow_blob_public_access          = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "westus3"
      + min_tls_version                   = "TLS1_0"
      + name                              = "checkcitfstatesa"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "check-ci-ado-bootstrap-omop-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "Deployment"  = "OHDSI on Azure"
          + "Environment" = "dev"
        }

      + blob_properties {
          + change_feed_enabled      = (known after apply)
          + default_service_version  = (known after apply)
          + last_access_time_enabled = (known after apply)
          + versioning_enabled       = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + customer_managed_key {
          + key_vault_key_id          = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # azurerm_storage_container.tfstatecontainer will be created
  + resource "azurerm_storage_container" "tfstatecontainer" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "check-ci-statefile-container"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "checkcitfstatesa"
    }

  # azurerm_subnet.vmss will be created
  + resource "azurerm_subnet" "vmss" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "check-ci-vmss-subnet"
      + resource_group_name                            = "check-ci-ado-bootstrap-omop-rg"
      + virtual_network_name                           = "check-ci-vmss-vnet"
    }

  # azurerm_virtual_machine_scale_set_extension.script_build_agent_dependencies will be created
  + resource "azurerm_virtual_machine_scale_set_extension" "script_build_agent_dependencies" {
      + auto_upgrade_minor_version   = true
      + id                           = (known after apply)
      + name                         = "check-ci-build-agent-dependencies"
      + publisher                    = "Microsoft.Compute"
      + settings                     = jsonencode(
            {
              + commandToExecute = "powershell.exe -ExecutionPolicy Unrestricted -Command "Copy-Item C:/AzureData/CustomData.bin ./build-agent-dependencies.ps1 -Force; ./build-agent-dependencies.ps1 *> C:/WindowsAzure/Logs/build-agent-dependencies.log""
            }
        )
      + type                         = "CustomScriptExtension"
      + type_handler_version         = "1.10"
      + virtual_machine_scale_set_id = (known after apply)
    }

  # azurerm_virtual_network.vmss will be created
  + resource "azurerm_virtual_network" "vmss" {
      + address_space         = [
          + "10.0.0.0/16",
        ]
      + dns_servers           = (known after apply)
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "westus3"
      + name                  = "check-ci-vmss-vnet"
      + resource_group_name   = "check-ci-ado-bootstrap-omop-rg"
      + subnet                = (known after apply)
      + tags                  = {
          + "Deployment"  = "OHDSI on Azure"
          + "Environment" = "dev"
        }
      + vm_protection_enabled = false
    }

  # azurerm_windows_virtual_machine.jumpbox-windows will be created
  + resource "azurerm_windows_virtual_machine" "jumpbox-windows" {
      + admin_password             = (sensitive value)
      + admin_username             = (sensitive)
      + allow_extension_operations = true
      + computer_name              = (known after apply)
      + enable_automatic_updates   = true
      + extensions_time_budget     = "PT1H30M"
      + hotpatching_enabled        = false
      + id                         = (known after apply)
      + location                   = "westus3"
      + max_bid_price              = -1
      + name                       = "checkcijump"
      + network_interface_ids      = (known after apply)
      + patch_mode                 = "AutomaticByOS"
      + platform_fault_domain      = -1
      + priority                   = "Regular"
      + private_ip_address         = (known after apply)
      + private_ip_addresses       = (known after apply)
      + provision_vm_agent         = true
      + public_ip_address          = (known after apply)
      + public_ip_addresses        = (known after apply)
      + resource_group_name        = "check-ci-ado-bootstrap-omop-rg"
      + size                       = "Standard_DS1_v2"
      + virtual_machine_id         = (known after apply)
      + zone                       = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }
    }

  # azurerm_windows_virtual_machine_scale_set.vmss will be created
  + resource "azurerm_windows_virtual_machine_scale_set" "vmss" {
      + admin_password                                    = (sensitive value)
      + admin_username                                    = (sensitive)
      + computer_name_prefix                              = "ado-build"
      + custom_data                                       = (sensitive value)
      + do_not_run_extensions_on_overprovisioned_machines = false
      + enable_automatic_updates                          = true
      + extensions_time_budget                            = "PT1H30M"
      + id                                                = (known after apply)
      + instances                                         = 1
      + location                                          = "westus3"
      + max_bid_price                                     = -1
      + name                                              = "check-ci-ado-build-windows-vmss-agent"
      + overprovision                                     = false
      + platform_fault_domain_count                       = 1
      + priority                                          = "Regular"
      + provision_vm_agent                                = true
      + resource_group_name                               = "check-ci-ado-bootstrap-omop-rg"
      + scale_in_policy                                   = "Default"
      + single_placement_group                            = false
      + sku                                               = "Standard_D4s_v3"
      + tags                                              = {
          + "Deployment"  = "OHDSI on Azure"
          + "Environment" = "dev"
        }
      + unique_id                                         = (known after apply)
      + upgrade_mode                                      = "Manual"
      + zone_balance                                      = false

      + automatic_instance_repair {
          + enabled      = (known after apply)
          + grace_period = (known after apply)
        }

      + boot_diagnostics {}

      + extension {
          + auto_upgrade_minor_version = (known after apply)
          + automatic_upgrade_enabled  = (known after apply)
          + force_update_tag           = (known after apply)
          + name                       = (known after apply)
          + protected_settings         = (sensitive value)
          + provision_after_extensions = (known after apply)
          + publisher                  = (known after apply)
          + settings                   = (known after apply)
          + type                       = (known after apply)
          + type_handler_version       = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_interface {
          + enable_accelerated_networking = false
          + enable_ip_forwarding          = false
          + name                          = "terraformnetworkprofile"
          + primary                       = true

          + ip_configuration {
              + name      = "IPConfiguration"
              + primary   = true
              + subnet_id = (known after apply)
              + version   = "IPv4"
            }
        }

      + os_disk {
          + caching                   = "ReadOnly"
          + disk_size_gb              = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }

      + terminate_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

  # null_resource.install_tf_ext will be created
  + resource "null_resource" "install_tf_ext" {
      + id       = (known after apply)
      + triggers = {
          + "ado_org_service_url" = (sensitive)
          + "ado_pat"             = (sensitive)
          + "ado_project_name"    = "OHDSIonAzure"
        }
    }

  # random_string.fqdn will be created
  + resource "random_string" "fqdn" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.azure_devops_elastic_pool_for_broadsea_build_pipeline_assignment.data.external.azure_devops_elastic_pool_pipeline_assignment will be read during apply
  # (config refers to values not yet known)
 <= data "external" "azure_devops_elastic_pool_pipeline_assignment"  {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "../modules/azure_devops_elastic_pool_pipeline_assignment/azure_devops_elastic_pool_pipeline_assignment.sh",
        ]
      + query   = {
          + "adoOrgServiceUrl" = (sensitive)
          + "adoPipelineId"    = (known after apply)
          + "adoProjectName"   = "check-ci-OHDSIonAzure"
          + "adoQueueId"       = (known after apply)
          + "authorized"       = "true"
          + "pat"              = (sensitive)
        }
      + result  = (known after apply)
    }

  # module.azure_devops_elastic_pool_for_broadsea_build_pipeline_assignment.null_resource.azure_devops_elastic_pool_pipeline_assignment_remove will be created
  + resource "null_resource" "azure_devops_elastic_pool_pipeline_assignment_remove" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.azure_devops_elastic_pool_for_broadsea_releasepipeline_assignment.data.external.azure_devops_elastic_pool_pipeline_assignment will be read during apply
  # (config refers to values not yet known)
 <= data "external" "azure_devops_elastic_pool_pipeline_assignment"  {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "../modules/azure_devops_elastic_pool_pipeline_assignment/azure_devops_elastic_pool_pipeline_assignment.sh",
        ]
      + query   = {
          + "adoOrgServiceUrl" = (sensitive)
          + "adoPipelineId"    = (known after apply)
          + "adoProjectName"   = "check-ci-OHDSIonAzure"
          + "adoQueueId"       = (known after apply)
          + "authorized"       = "true"
          + "pat"              = (sensitive)
        }
      + result  = (known after apply)
    }

  # module.azure_devops_elastic_pool_for_broadsea_releasepipeline_assignment.null_resource.azure_devops_elastic_pool_pipeline_assignment_remove will be created
  + resource "null_resource" "azure_devops_elastic_pool_pipeline_assignment_remove" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.azure_devops_elastic_pool_for_tf_apply_environment_pipeline_assignment.data.external.azure_devops_elastic_pool_pipeline_assignment will be read during apply
  # (config refers to values not yet known)
 <= data "external" "azure_devops_elastic_pool_pipeline_assignment"  {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "../modules/azure_devops_elastic_pool_pipeline_assignment/azure_devops_elastic_pool_pipeline_assignment.sh",
        ]
      + query   = {
          + "adoOrgServiceUrl" = (sensitive)
          + "adoPipelineId"    = (known after apply)
          + "adoProjectName"   = "check-ci-OHDSIonAzure"
          + "adoQueueId"       = (known after apply)
          + "authorized"       = "true"
          + "pat"              = (sensitive)
        }
      + result  = (known after apply)
    }

  # module.azure_devops_elastic_pool_for_tf_apply_environment_pipeline_assignment.null_resource.azure_devops_elastic_pool_pipeline_assignment_remove will be created
  + resource "null_resource" "azure_devops_elastic_pool_pipeline_assignment_remove" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.azure_devops_elastic_pool_for_tf_destroy_environment_pipeline_assignment.data.external.azure_devops_elastic_pool_pipeline_assignment will be read during apply
  # (config refers to values not yet known)
 <= data "external" "azure_devops_elastic_pool_pipeline_assignment"  {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "../modules/azure_devops_elastic_pool_pipeline_assignment/azure_devops_elastic_pool_pipeline_assignment.sh",
        ]
      + query   = {
          + "adoOrgServiceUrl" = (sensitive)
          + "adoPipelineId"    = (known after apply)
          + "adoProjectName"   = "check-ci-OHDSIonAzure"
          + "adoQueueId"       = (known after apply)
          + "authorized"       = "true"
          + "pat"              = (sensitive)
        }
      + result  = (known after apply)
    }

  # module.azure_devops_elastic_pool_for_tf_destroy_environment_pipeline_assignment.null_resource.azure_devops_elastic_pool_pipeline_assignment_remove will be created
  + resource "null_resource" "azure_devops_elastic_pool_pipeline_assignment_remove" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.azure_devops_elastic_pool_for_vocabulary_build_pipeline_assignment.data.external.azure_devops_elastic_pool_pipeline_assignment will be read during apply
  # (config refers to values not yet known)
 <= data "external" "azure_devops_elastic_pool_pipeline_assignment"  {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "../modules/azure_devops_elastic_pool_pipeline_assignment/azure_devops_elastic_pool_pipeline_assignment.sh",
        ]
      + query   = {
          + "adoOrgServiceUrl" = (sensitive)
          + "adoPipelineId"    = (known after apply)
          + "adoProjectName"   = "check-ci-OHDSIonAzure"
          + "adoQueueId"       = (known after apply)
          + "authorized"       = "true"
          + "pat"              = (sensitive)
        }
      + result  = (known after apply)
    }

  # module.azure_devops_elastic_pool_for_vocabulary_build_pipeline_assignment.null_resource.azure_devops_elastic_pool_pipeline_assignment_remove will be created
  + resource "null_resource" "azure_devops_elastic_pool_pipeline_assignment_remove" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.azure_devops_elastic_pool_for_vocabulary_release_pipeline_assignment.data.external.azure_devops_elastic_pool_pipeline_assignment will be read during apply
  # (config refers to values not yet known)
 <= data "external" "azure_devops_elastic_pool_pipeline_assignment"  {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "../modules/azure_devops_elastic_pool_pipeline_assignment/azure_devops_elastic_pool_pipeline_assignment.sh",
        ]
      + query   = {
          + "adoOrgServiceUrl" = (sensitive)
          + "adoPipelineId"    = (known after apply)
          + "adoProjectName"   = "check-ci-OHDSIonAzure"
          + "adoQueueId"       = (known after apply)
          + "authorized"       = "true"
          + "pat"              = (sensitive)
        }
      + result  = (known after apply)
    }

  # module.azure_devops_elastic_pool_for_vocabulary_release_pipeline_assignment.null_resource.azure_devops_elastic_pool_pipeline_assignment_remove will be created
  + resource "null_resource" "azure_devops_elastic_pool_pipeline_assignment_remove" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.azure_devops_elastic_pool_linux_vmss_pool.data.external.AddVMSSAgentPool will be read during apply
  # (config refers to values not yet known)
 <= data "external" "AddVMSSAgentPool"  {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "../modules/azure_devops_elastic_pool/v0/VMSSAgentPoolCreate.sh",
        ]
      + query   = {
          + "adoOrgServiceUrl"    = (sensitive)
          + "desiredIdle"         = "1"
          + "desiredSize"         = "1"
          + "maxCapacity"         = "2"
          + "osType"              = "linux"
          + "pat"                 = (sensitive)
          + "poolname"            = "check-ci-ado-build-linux-vmss-agent-pool"
          + "projectId"           = (known after apply)
          + "recycleAfterEachUse" = "false"
          + "resourceId"          = (known after apply)
          + "serviceEndpointId"   = (known after apply)
          + "timeToLiveMinutes"   = "30"
        }
      + result  = (known after apply)
    }

  # module.azure_devops_elastic_pool_linux_vmss_pool.null_resource.RemoveVMSSAgentPool will be created
  + resource "null_resource" "RemoveVMSSAgentPool" {
      + id       = (known after apply)
      + triggers = {
          + "ado_agent_pool_name" = "check-ci-ado-build-linux-vmss-agent-pool"
          + "ado_org_service_url" = (sensitive)
          + "ado_pat"             = (sensitive)
        }
    }

  # module.azure_devops_elastic_pool_windows_vmss_pool.data.external.AddVMSSAgentPool will be read during apply
  # (config refers to values not yet known)
 <= data "external" "AddVMSSAgentPool"  {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "../modules/azure_devops_elastic_pool/v0/VMSSAgentPoolCreate.sh",
        ]
      + query   = {
          + "adoOrgServiceUrl"    = (sensitive)
          + "desiredIdle"         = "1"
          + "desiredSize"         = "1"
          + "maxCapacity"         = "2"
          + "osType"              = "windows"
          + "pat"                 = (sensitive)
          + "poolname"            = "check-ci-ado-build-windows-vmss-agent-pool"
          + "projectId"           = (known after apply)
          + "recycleAfterEachUse" = "false"
          + "resourceId"          = (known after apply)
          + "serviceEndpointId"   = (known after apply)
          + "timeToLiveMinutes"   = "30"
        }
      + result  = (known after apply)
    }

  # module.azure_devops_elastic_pool_windows_vmss_pool.null_resource.RemoveVMSSAgentPool will be created
  + resource "null_resource" "RemoveVMSSAgentPool" {
      + id       = (known after apply)
      + triggers = {
          + "ado_agent_pool_name" = "check-ci-ado-build-windows-vmss-agent-pool"
          + "ado_org_service_url" = (sensitive)
          + "ado_pat"             = (sensitive)
        }
    }

  # module.azure_devops_environment_broadsea_build.azuredevops_environment.adoenvironment will be created
  + resource "azuredevops_environment" "adoenvironment" {
      + id         = (known after apply)
      + name       = "check-ci-omop-broadsea-build-environment"
      + project_id = (known after apply)
    }

  # module.azure_devops_environment_broadsea_build_pipeline_assignment.data.external.azure_devops_environment_pipeline_assignment will be read during apply
  # (config refers to values not yet known)
 <= data "external" "azure_devops_environment_pipeline_assignment"  {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "../modules/azure_devops_environment_pipeline_assignment/azure_devops_environment_pipeline_assignment.sh",
        ]
      + query   = {
          + "adoEnvironmentId" = (known after apply)
          + "adoOrgServiceUrl" = (sensitive)
          + "adoPipelineId"    = (known after apply)
          + "adoProjectName"   = "check-ci-OHDSIonAzure"
          + "authorized"       = "true"
          + "pat"              = (sensitive)
        }
      + result  = (known after apply)
    }

  # module.azure_devops_environment_broadsea_build_pipeline_assignment.null_resource.azure_devops_environment_pipeline_assignment_remove will be created
  + resource "null_resource" "azure_devops_environment_pipeline_assignment_remove" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.azure_devops_environment_broadsea_release.azuredevops_environment.adoenvironment will be created
  + resource "azuredevops_environment" "adoenvironment" {
      + id         = (known after apply)
      + name       = "check-ci-omop-broadsea-release-environment"
      + project_id = (known after apply)
    }

  # module.azure_devops_environment_broadsea_release_pipeline_assignment.data.external.azure_devops_environment_pipeline_assignment will be read during apply
  # (config refers to values not yet known)
 <= data "external" "azure_devops_environment_pipeline_assignment"  {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "../modules/azure_devops_environment_pipeline_assignment/azure_devops_environment_pipeline_assignment.sh",
        ]
      + query   = {
          + "adoEnvironmentId" = (known after apply)
          + "adoOrgServiceUrl" = (sensitive)
          + "adoPipelineId"    = (known after apply)
          + "adoProjectName"   = "check-ci-OHDSIonAzure"
          + "authorized"       = "true"
          + "pat"              = (sensitive)
        }
      + result  = (known after apply)
    }

  # module.azure_devops_environment_broadsea_release_pipeline_assignment.null_resource.azure_devops_environment_pipeline_assignment_remove will be created
  + resource "null_resource" "azure_devops_environment_pipeline_assignment_remove" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.azure_devops_environment_tf_apply.azuredevops_environment.adoenvironment will be created
  + resource "azuredevops_environment" "adoenvironment" {
      + id         = (known after apply)
      + name       = "check-ci-omop-tf-apply-environment"
      + project_id = (known after apply)
    }

  # module.azure_devops_environment_tf_apply_pipeline_assignment.data.external.azure_devops_environment_pipeline_assignment will be read during apply
  # (config refers to values not yet known)
 <= data "external" "azure_devops_environment_pipeline_assignment"  {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "../modules/azure_devops_environment_pipeline_assignment/azure_devops_environment_pipeline_assignment.sh",
        ]
      + query   = {
          + "adoEnvironmentId" = (known after apply)
          + "adoOrgServiceUrl" = (sensitive)
          + "adoPipelineId"    = (known after apply)
          + "adoProjectName"   = "check-ci-OHDSIonAzure"
          + "authorized"       = "true"
          + "pat"              = (sensitive)
        }
      + result  = (known after apply)
    }

  # module.azure_devops_environment_tf_apply_pipeline_assignment.null_resource.azure_devops_environment_pipeline_assignment_remove will be created
  + resource "null_resource" "azure_devops_environment_pipeline_assignment_remove" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.azure_devops_environment_tf_destroy_pipeline_assignment.data.external.azure_devops_environment_pipeline_assignment will be read during apply
  # (config refers to values not yet known)
 <= data "external" "azure_devops_environment_pipeline_assignment"  {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "../modules/azure_devops_environment_pipeline_assignment/azure_devops_environment_pipeline_assignment.sh",
        ]
      + query   = {
          + "adoEnvironmentId" = (known after apply)
          + "adoOrgServiceUrl" = (sensitive)
          + "adoPipelineId"    = (known after apply)
          + "adoProjectName"   = "check-ci-OHDSIonAzure"
          + "authorized"       = "true"
          + "pat"              = (sensitive)
        }
      + result  = (known after apply)
    }

  # module.azure_devops_environment_tf_destroy_pipeline_assignment.null_resource.azure_devops_environment_pipeline_assignment_remove will be created
  + resource "null_resource" "azure_devops_environment_pipeline_assignment_remove" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.azure_devops_environment_tf_plan.azuredevops_environment.adoenvironment will be created
  + resource "azuredevops_environment" "adoenvironment" {
      + id         = (known after apply)
      + name       = "check-ci-omop-tf-plan-environment"
      + project_id = (known after apply)
    }

  # module.azure_devops_environment_tf_plan_pipeline_assignment.data.external.azure_devops_environment_pipeline_assignment will be read during apply
  # (config refers to values not yet known)
 <= data "external" "azure_devops_environment_pipeline_assignment"  {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "../modules/azure_devops_environment_pipeline_assignment/azure_devops_environment_pipeline_assignment.sh",
        ]
      + query   = {
          + "adoEnvironmentId" = (known after apply)
          + "adoOrgServiceUrl" = (sensitive)
          + "adoPipelineId"    = (known after apply)
          + "adoProjectName"   = "check-ci-OHDSIonAzure"
          + "authorized"       = "true"
          + "pat"              = (sensitive)
        }
      + result  = (known after apply)
    }

  # module.azure_devops_environment_tf_plan_pipeline_assignment.null_resource.azure_devops_environment_pipeline_assignment_remove will be created
  + resource "null_resource" "azure_devops_environment_pipeline_assignment_remove" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.azure_devops_environment_vocabulary_build.azuredevops_environment.adoenvironment will be created
  + resource "azuredevops_environment" "adoenvironment" {
      + id         = (known after apply)
      + name       = "check-ci-omop-vocabulary-build-environment"
      + project_id = (known after apply)
    }

  # module.azure_devops_environment_vocabulary_build_pipeline_assignment.data.external.azure_devops_environment_pipeline_assignment will be read during apply
  # (config refers to values not yet known)
 <= data "external" "azure_devops_environment_pipeline_assignment"  {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "../modules/azure_devops_environment_pipeline_assignment/azure_devops_environment_pipeline_assignment.sh",
        ]
      + query   = {
          + "adoEnvironmentId" = (known after apply)
          + "adoOrgServiceUrl" = (sensitive)
          + "adoPipelineId"    = (known after apply)
          + "adoProjectName"   = "check-ci-OHDSIonAzure"
          + "authorized"       = "true"
          + "pat"              = (sensitive)
        }
      + result  = (known after apply)
    }

  # module.azure_devops_environment_vocabulary_build_pipeline_assignment.null_resource.azure_devops_environment_pipeline_assignment_remove will be created
  + resource "null_resource" "azure_devops_environment_pipeline_assignment_remove" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.azure_devops_environment_vocabulary_release.azuredevops_environment.adoenvironment will be created
  + resource "azuredevops_environment" "adoenvironment" {
      + id         = (known after apply)
      + name       = "check-ci-omop-vocabulary-release-environment"
      + project_id = (known after apply)
    }

  # module.azure_devops_environment_vocabulary_release_pipeline_assignment.data.external.azure_devops_environment_pipeline_assignment will be read during apply
  # (config refers to values not yet known)
 <= data "external" "azure_devops_environment_pipeline_assignment"  {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "../modules/azure_devops_environment_pipeline_assignment/azure_devops_environment_pipeline_assignment.sh",
        ]
      + query   = {
          + "adoEnvironmentId" = (known after apply)
          + "adoOrgServiceUrl" = (sensitive)
          + "adoPipelineId"    = (known after apply)
          + "adoProjectName"   = "check-ci-OHDSIonAzure"
          + "authorized"       = "true"
          + "pat"              = (sensitive)
        }
      + result  = (known after apply)
    }

  # module.azure_devops_environment_vocabulary_release_pipeline_assignment.null_resource.azure_devops_environment_pipeline_assignment_remove will be created
  + resource "null_resource" "azure_devops_environment_pipeline_assignment_remove" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

Plan: 71 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + adoEnvironmentPipelineIds = [
      + (known after apply),
    ]
  + jumpbox_public_ip         = (sensitive value)
  + jumpbox_public_ip_fqdn    = (sensitive value)
  + vmssAgentPoolId           = (known after apply)
  + vmssAgentQueueId          = (known after apply)
  + vmssElasticPoolId         = (known after apply)
  + vmss_public_ip_fqdn       = (sensitive value)
```

</details>

*Pusher: @plooploops, Action: `pull_request`, Workflow: `Build Validation`*